Revit 2026 API

# BIMExportOptions Properties

---

The BIMExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. |

#### Reference

BIMExportOptions Class

Autodesk.Revit.DB Namespace